week12/1-authentication/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(e_mail: params[:session][:e_mail])
---
SELECT  "users".* FROM "users" WHERE "users"."e_mail" = ? LIMIT 1  [["e_mail", "emkataburgas@gmail.com"]]