week12/1-authentication/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "e_mail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "emo"], ["password", "pokemon"], ["e_mail", "emkataburgas@gmail.com"], ["created_at", "2016-03-08 19:14:01.343646"], ["updated_at", "2016-03-08 19:14:01.343646"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "qqqqq"], ["password_digest", "$2a$10$1wFtpO18XVOwGDFAaoU89ODKvasSL.bhEGah1bEzxi1D73mSP.7n."], ["updated_at", "2016-03-10 18:39:42.314692"], ["id", 8]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)