week11/1-course-management/app/controllers/lectures_controller.rb

SELECT "lectures".* FROM "lectures"
---
  def index
    @lectures = Lecture.all

INSERT INTO "lectures" ("name", "text_body") VALUES (?, ?)  [["name", "Rails"], ["text_body", "genata vodi rails i e mn pechen"]]
---
  def create
    @lecture = Lecture.new(lectures_params)
    if @lecture.save

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "lectures" WHERE "lectures"."id" = ?  [["id", 1]]
---
  def destroy
    @lecture = Lecture.find(params[:id])
    @lecture.destroy

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @lecture = Lecture.find(params[:id])

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "lectures" SET "name" = ?, "text_body" = ? WHERE "lectures"."id" = 1  [["name", "asdffsdf"], ["text_body", "fasfads"]]
---
  def update
    @lecture = Lecture.find(params[:id])
    @lecture.name = lectures_params[:name]
    @lecture.text_body = lectures_params[:text_body]
    if @lecture.save