week11/1-course-management/app/controllers/solutions_controller.rb

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
	def index
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:task_id])

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
	def new
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:task_id])

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "solutions" ("task_id", "text_block") VALUES (?, ?)  [["task_id", 1], ["text_block", "sdf"]]
---
	def create
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:task_id])
		@solution = @task.solutions.build(solution_params)
		if @solution.save

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "solutions".* FROM "solutions"  WHERE "solutions"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:task_id])
		@solution = Solution.find(params[:id])

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "solutions".* FROM "solutions"  WHERE "solutions"."id" = ? LIMIT 1  [["id", 3]]
---
	def edit
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:task_id])
		@solution = Solution.find(params[:id])

SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "solutions".* FROM "solutions"  WHERE "solutions"."task_id" = ? AND "solutions"."id" = ? LIMIT 1  [["task_id", 5], ["id", 3]]
UPDATE "solutions" SET "text_block" = ? WHERE "solutions"."id" = 3  [["text_block", "asdss"]]
---
	def update
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:task_id])
		@solution = @task.solutions.find(params[:id])
		if @solution.update(solution_params)

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "solutions".* FROM "solutions"  WHERE "solutions"."task_id" = ? AND "solutions"."id" = ? LIMIT 1  [["task_id", 5], ["id", 3]]
DELETE FROM "solutions" WHERE "solutions"."id" = ?  [["id", 3]]
---
	def destroy
		@task = Task.find(params[:task_id])
		@solution = @task.solutions.find(params[:id])
		@solution.destroy