week11/1-course-management/app/controllers/tasks_controller.rb

	def index
		@lecture = Lecture.find(params[:lecture_id])
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]

	def new
		@lecture = Lecture.find(params[:lecture_id])
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@lecture = Lecture.find(params[:lecture_id])
		@task = @lecture.tasks.build(task_params)
		if @task.save
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("description", "lecture_id", "name") VALUES (?, ?, ?)  [["description", "guides"], ["lecture_id", 1], ["name", "Cheti "]]

	def edit
		@lecture = Lecture.find(params[:lecture_id])
		@task = @lecture.tasks.find(params[:id])
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 1], ["id", 1]]

	def update
		@lecture = Lecture.find(params[:lecture_id])
		@task = @lecture.tasks.find(params[:id])
		if @task.update(task_params)
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 1], ["id", 1]]
UPDATE "tasks" SET "description" = ? WHERE "tasks"."id" = 1  [["description", "guidessss"]]

	def destroy
		@lecture = Lecture.find(params[:lecture_id])
		@task = @lecture.tasks.find(params[:id])
		@task.destroy
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."lecture_id" = ? AND "tasks"."id" = ? LIMIT 1  [["lecture_id", 1], ["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

	def show
		@lecture = Lecture.find(params[:lecture_id])
		@task = Task.find(params[:id])
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]